db.createCollection("shifts");

db.shifts.insertMany([
    {
        "shift": "Перша",
        "date": "21 квітня 2024",
        "nurses": ["Євгенія Олександрівна", "Наталія Вікторівна"],
        "department": "Терапія",
        "wardNumbers": ["101", "102"]
    },
    {
        "shift": "Друга",
        "date": "22 квітня 2024",
        "nurses": ["Іванна Степанівна", "Олена Василівна"],
        "department": "Хірургія",
        "wardNumbers": ["201", "202", "203"]
    },
    {
        "shift": "Третя",
        "date": "23 квітня 2024",
        "nurses": ["Василь Миколайович", "Олексій Вікторович"],
        "department": "Педіатрія",
        "wardNumbers": ["301", "302"]
    },
    {
        "shift": "Перша",
        "date": "24 квітня 2024",
        "nurses": ["Людмила Олександрівна", "Тетяна Михайлівна"],
        "department": "Хірургія",
        "wardNumbers": ["201", "202", "205"]
    },
    {
        "shift": "Друга",
        "date": "25 квітня 2024",
        "nurses": ["Світлана Іванівна", "Ольга Петрівна"],
        "department": "Неврологія",
        "wardNumbers": ["501", "502", "503"]
    },
    {
        "shift": "Третя",
        "date": "26 квітня 2024",
        "nurses": ["Марина Василівна", "Ірина Володимирівна", "Євгенія Олегівна"],
        "department": "Педіатрія",
        "wardNumbers": ["301", "305", "306"]
    },
    {
        "shift": "Перша",
        "date": "27 квітня 2024",
        "nurses": ["Марина Василівна", "Михайло Павлович"],
        "department": "Педіатрія",
        "wardNumbers": ["301", "302", "303"]
    },
    {
        "shift": "Друга",
        "date": "28 квітня 2024",
        "nurses": ["Наталія Вікторівна", "Євгенія Олександрівна"],
        "department": "Терапія",
        "wardNumbers": ["103", "104"]
    },
    {
        "shift": "Третя",
        "date": "29 квітня 2024",
        "nurses": ["Наталія Вікторівна", "Євгенія Олександрівна", "Констянтин Павлович"],
        "department": "Неврологія",
        "wardNumbers": ["503", "505"]
    }
]);